app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (draft = false) AND (created_at >= '2016-04-12 15:53:51.962761')
---
  def index
    @books = Book.where("draft = false").where("created_at >= ?", 1.week.ago.utc)

SELECT "books".* FROM "books" WHERE (draft = true AND user_id = 1)
---
  def drafts
    @books = Book.where("draft = true AND user_id = #{current_user.id}")

SELECT "books".* FROM "books" WHERE (user_id = 1)
---
  def user_books
    @books = Book.where("user_id = #{current_user.id}")

SELECT "genres".* FROM "genres"
---
  def new
    @user = current_user
    @book = @user.books.new
    @genres = Genre.all

SELECT "genres".* FROM "genres"
INSERT INTO "books" ("name", "author", "image", "description", "draft", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = current_user
    @book = @user.books.new(book_params)
    @genres = Genre.all
    if @book.save